[
  {
    "id": 1,
    "name": "Hanna",
    "genre": "Suspense",
    "synopsis": "Hanna (Esme Creed-Miles) é uma adolescente que mora com o pai na zona rural da Finlândia. Sua rotina pacata muda quando ela conhece um ex-agente da CIA que planeja matar todos os seus inimigos dentro do serviço de inteligência. Hanna, então, passa por um pesado treinamento e não demora a se tornar uma hábil asssassina. Agora, ela embarca numa missão contra a CIA que pode custar sua própria vida.",
    "liked": true,
    "seasons": []
  },
  {
    "id": 2,
    "name": "Friends",
    "genre": "Comédia",
    "synopsis": "Seis jovens são unidos por laços familiares, românticos e, principalmente, de amizade, enquanto tentam vingar em Nova York. Rachel é a garota mimada que deixa o noivo no altar para viver com a amiga dos tempos de escola Monica, sistemática e apaixonada pela culinária. Monica é irmã de Ross, um paleontólogo que é abandonado pela esposa, que descobriu ser lésbica. Do outro lado do corredor do apartamento de Monica e Rachel, moram Joey, um ator frustrado, e Chandler, de profissão misteriosa. A turma é completa pela exótica Phoebe.",
    "liked": true,
    "seasons": []
  },
  {
    "id": 3,
    "name": "The Witcher",
    "genre": "Drama",
    "synopsis": "Geralt de Rivia (Cavill) é um bruxo, um mutante com poderes especiais que mata monstros por dinheiro. A Terra está num estado de caos enquanto o império de Nilfgaard procura expandir o seu território. Entre os refugiados desta luta está Cirilla (Freya Allan), também chamada Ciri, a Princesa de Cintra, que está sendo perseguida por Nilfgaard. Ela e o Geralt estão destinados um ao outro. Em suas aventuras Geralt também conhece Yennefer de Vengerberg (Anya Chalotra), uma feiticiera.",
    "liked": true,
    "seasons": [
      {
        "id": 1,
        "code": "season01",
        "episodes": [
          {
            "id": 1,
            "code": "EP01",
            "name": "The End's Beginning",
            "wacthed": true
          },
          { "id": 2, "code": "EP02", "name": "Four Marks", "wacthed": true },
          {
            "id": 3,
            "code": "EP03",
            "name": "Betrayer Moon3",
            "wacthed": true
          },
          {
            "id": 4,
            "code": "EP04",
            "name": "Of Banquets, Bastards and Burials",
            "wacthed": true
          },
          {
            "id": 5,
            "code": "EP05",
            "name": "Bottled Appetites",
            "wacthed": true
          },
          { "id": 6, "code": "EP06", "name": "Rare Species", "wacthed": true },
          { "id": 7, "code": "EP07", "name": "Before a Fall", "wacthed": true },
          { "id": 8, "code": "EP08", "name": "Much More", "wacthed": true }
        ]
      }
    ]
  },
  {
    "id": 4,
    "name": "Oscuro Deseo",
    "genre": "Drama",
    "synopsis": "A advogada e professora universitária Alma Solares (Maite Perroni) é casada com o respeitado juiz Leonardo Solares (Jorge Poza) com quem tem uma filha, Zoe Solares (Regina Pavón). Certa de que está sendo traída pelo marido, ela decide passar um fim de semana na casa de sua melhor amiga, Brenda (María Fernanda Yapes). Nesse passeio, Alma conhece o novo Darío (Alejandro Speitzer), com quem vive uma intensa paixão. Entretanto, um crime acaba transformando sua vida e movimentando sua família, fazendo-a questionar a verdade sobre as pessoas próximas. Com a ajuda do cunhado, Esteban (Erik Hayser), ela começa uma investigação com desdobramentos inesperados.",
    "liked": true,
    "seasons": []
  },
  {
    "id": 5,
    "name": "Emily in Paris",
    "genre": "Comédia Dramática",
    "synopsis": "Emily, uma mulher americana do Centro-Oeste, que se muda para Paris para uma oportunidade de emprego e que experimenta um choque cultural.",
    "liked": true,
    "seasons": []
  },
  {
    "id": 6,
    "name": "Sex Education",
    "genre": "Drama teen",
    "synopsis": "Em Sex Education, Otis (Asa Butterfield) é um adolescente socialmente inapto que vive com sua mãe, uma terapeuta sexual. Apesar de não ter perdido a virgindade ainda, ele é uma espécie de especialista em sexo. Junto com Maeve, uma colega de classe rebelde, ele resolve montar sua própria clínica de saúde sexual para ajudar outros estudantes da escola.",
    "liked": true,
    "seasons": []
  }
]
